app/Http/Controllers/API/FrontDataController.php

    public function getFundClassifications()
    {
        $responseArr = [];
        $dataArr = FundType::select(['name','ft_id'])->get();
---
select `name`, `ft_id` from `mpx_fund_type`