app/Http/Controllers/Web/PageController.php

select * from `mpx_blog` where `status` = 1 and `mpx_blog`.`deleted_at` is null order by `updated_at` desc limit 3
---
            // $plansMdl = Plans::list(['status' => $status, 'show_on_wa' => $commonconstants['y_n_val'][1]], ['p_id', 'plan_name', 'amount', 'duration_name'], 'c_order', 'ASC');

            // $blogPosts = json_decode(file_get_contents(env('BLOG_URL') . '/wp-json/wp/v2/posts/?_embed&per_page=3'), true);
            $blogPosts=BlogModel::where('status', 1)
            ->orderBy('updated_at', 'desc')
            ->limit(3)
            ->get();

select * from `mpx_new_from_myplexus`
---

            $nfoMdl = NfoOffer::frontList([], '', '', '','',5);

			$allnewfroms = NewFromMyplexus::all();