app/Models/BannerModel.php

    public static function bannerList($filterArr = false, $fields = false, $orderBy = false, $order = false, $perPage = false)
    {
        if ($fields == false) {
            $fields = ['*'];
        }
        $query = BannerModel::with('media')->select($fields);

        $bannerGroup = isset($filterArr['bnr_group']) ? $filterArr['bnr_group'] : null;
        $query->where('bnr_group', '=', $bannerGroup);

        $status = isset($filterArr['status']) ? intval($filterArr['status']) : 0;
        if ($status > 0) {
            $query->where('status', '=', $status);
        }

        if ($orderBy == false && $order == false) {
            $orderBy = 'bnr_id';
            $order = 'DESC';
        }

        $query->orderBy($orderBy, $order);
        return $perPage ? $query->paginate($perPage) : $query->get();
---
select * from `mpx_banner` where `bnr_group` = 'home-banner' and `status` = 1 order by `c_order` desc
select * from `mpx_media` where `mpx_media`.`media_id` in (7, 8, 9, 10, 11)