app/Models/CustomFieldGroupValueModel.php

select * from `mpx_custom_field_group_type_values` inner join `mpx_custom_field_group_type_class_template` on `mpx_custom_field_group_type_class_template`.`cf_gt_class_template_id` = `mpx_custom_field_group_type_values`.`cf_gt_class_template_id` inner join `mpx_custom_field_group_type` on `mpx_custom_field_group_type_class_template`.`cf_group_type_id` = `mpx_custom_field_group_type`.`cf_group_type_id` where (`mpx_custom_field_group_type_values`.`data_id` = 1 and `mpx_custom_field_group_type_class_template`.`class_id` = 7 and `mpx_custom_field_group_type_class_template`.`template_id` = 1) and `mpx_custom_field_group_type`.`field_for` in ('a', 'w', 'ap') order by `c_order` asc
---
    public static function getCfGroupDataValues($class_id, $template_id, $data_id, $field_forArr = [])
    {
        $cfArr = [];
        if ($class_id > 0 && $data_id > 0 && $template_id > 0) {
            $query = CustomFieldGroupValueModel::join('custom_field_group_type_class_template', 'custom_field_group_type_class_template.cf_gt_class_template_id', '=', 'custom_field_group_type_values.cf_gt_class_template_id')->join('custom_field_group_type', 'custom_field_group_type_class_template.cf_group_type_id', '=', 'custom_field_group_type.cf_group_type_id')->where(['custom_field_group_type_values.data_id' => $data_id, 'custom_field_group_type_class_template.class_id' => $class_id, 'custom_field_group_type_class_template.template_id' => $template_id]);

            if (count($field_forArr) > 0) {
                $query->whereIn('custom_field_group_type.field_for', $field_forArr);
            }
            $cfGroupValuesModel = $query->orderBy('c_order', 'ASC')->get();