app/Models/MediaModel.php

select `path` from `mpx_media` where `media_id` = 16 limit 1
---
    public static function getMediaPath($dataId)
    {
        return MediaModel::where('media_id', '=', $dataId)->value('path');