app/Models/MenuTypeModel.php

    public function getTopMenu($menu_for = 'p', $menu_name = '', $append_container_class = '', $ul_class = 'ul-navbar'){
        $query = MenuTypeModel::with(['menus' => function ($query) {
            $query->where(['parent_menu_id' => 0]);
        }])->where(['menu_for' => $menu_for, 'status' => 1]);
        if ($menu_name)
            $query->where(['menu_name' => trim($menu_name)]);
        $menuTypeModel = $query->orderBy('c_order', 'asc')
            ->first();
---
select * from `mpx_menu` where `mpx_menu`.`parent_menu_id` = 33 and `mpx_menu`.`parent_menu_id` is not null order by `c_order` asc