app/Models/NfoOffer.php

select * from `mpx_media` where `mpx_media`.`media_id` in (77)
select * from `mpx_nfo_offer` where `no_id` = 231 and `status` = 1
---
    public static function getData($filterArr = false, $fields = false)
    {
        if ($fields == false) {
            $fields = ['*'];
        }
        $query = NfoOffer::select($fields)->with(['media','fundtype','indices']);

        $no_id = isset($filterArr['no_id']) ? intval($filterArr['no_id']) : 0;
        if ($no_id > 0) {
            $query->where('no_id', '=', $no_id);
        }
        $status = isset($filterArr['status']) ? intval($filterArr['status']) : 0;
        if ($status > 0) {
            $query->where('status', '=', $status);
        }
        $type = isset($filterArr['type']) ? $filterArr['type'] : null;
        if($type != null){
            $query->where('type', '=', $type);
        }

        return $query->get()->first();

select DATE_FORMAT(post_date, "%Y") AS year, COUNT(no_id) AS tot from `mpx_nfo_offer` group by year order by year DESC
---
    public static function archiveGroupList()
    {
        $commonconstants = Config('commonconstants');

      //  \DB::enableQueryLog(); // Enable query log

		/*NfoOffer::selectRaw('DATE_FORMAT(post_date, "%Y") AS year, COUNT(no_id) AS tot')->where(['status' => $commonconstants['status_val'][1], 'type' => $commonconstants['nfo_monitor_type']['value'][2]])->groupByRaw('year')->orderByRaw('year DESC')->get();*/

        $yearExpr = self::yearExpression('post_date');

        return NfoOffer::selectRaw("{$yearExpr} AS year, COUNT(no_id) AS tot")->groupByRaw('year')->orderByRaw('year DESC')->get();