app/Models/TestimonialModel.php

select * from `mpx_media` where `mpx_media`.`media_id` in (12, 13, 14, 15)
---
  public static function testimonialList($filterArr = false, $fields = false, $orderBy = false, $order = false, $perPage = false)
  {
    if ($fields == false) {
      $fields = ['*'];
    }
    $query = TestimonialModel::with('media')->select($fields);

    $status = isset($filterArr['status']) ? intval($filterArr['status']) : 0;
    if ($status > 0) {
      $query->where('status', '=', $status);
    }

    if ($orderBy == false && $order == false) {
      $orderBy = 'tmnl_id';
      $order = 'DESC';
    }

    $query->orderBy($orderBy, $order);
    return $perPage ? $query->paginate($perPage) : $query->get();